/* 
剑指 Offer 11. 旋转数组的最小数字
把一个数组最开始的若干个元素搬到数组的末尾，我们称之为数组的旋转。输入一个递增排序的数组的一个旋转，输出旋转数组的最小元素。例如，数组 [3,4,5,1,2] 为 [1,2,3,4,5] 的一个旋转，该数组的最小值为1。  
示例 1：
输入：[3,4,5,1,2]
输出：1

示例 2：
输入：[2,2,2,0,1]
输出：0
注意：本题与主站 154 题相同：https://leetcode-cn.com/problems/find-minimum-in-rotated-sorted-array-ii/
------------------------------------------------------------------------------------------------------
题解：从题目来看，数组a中找出第一个比a[0]小的数，随便写个for循环想看看样例，然后AC了.........................................................................吐了
好吧，正经点，从题目来看应该是想考二分，但这个题也太敷衍了，懒得写了，简单说一下
数组a,长度为n,i = 0,j=n-1,mid = (j-i) /2
如果 a[mid] >= a[0]，则i=mid , mid = (j-i) /2
如果 a[mid] <a[0] 则 j =mid  mid  = (j-i) /2
结束条件  i>=j
*/
/**
 * @param {number[]} numbers
 * @return {number}
 */
 var minArray = function(numbers) {
     for(let i = 1;i<numbers.length;++i){
         if(numbers[i] < numbers[i-1])
         return numbers[i]
     }
     return numbers[0]
};